import { scrollToTop } from "../funcs/utils.js";
let $ = document;
let showMoreFooterBtn = $.querySelector('.footer-four__right-btn')
document.querySelector('.btnScrollTop').onclick = scrollToTop

//btn for show more description on footer
showMoreFooterBtn.onclick = () => {
  if ($.querySelector('.footer-four__right-btn__title').innerHTML == 'مشاهده بیشتر') {
    $.querySelector('.footer-four__right-text').innerHTML =
      `
لاوین سال‌ها است که به انتخاب اول بسیاری از خریداران اینترنتی تبدیل شده است. لاوین به عنوان بزرگ‌ترین و معتبرترین فروشگاه آنلاین ایران، شناخته‌شده‌ترین فروشگاه نیز محسوب می‌شود. این فروشگاه آنلاین نه‌تنها گسترده‌ترین تنوع کالا را در دسته‌بندی‌های مختلف ارائه می‌دهد، بلکه با خدمات بی‌نظیر، سرعت ارسال بالا، ضمانت اصل بودن کالا و پشتیبانی حرفه‌ای، استاندارد جدیدی در خرید اینترنتی ایران تعریف کرده است. این فروشگاه با سال‌ها تجربه و اعتماد مشتریان، کامل‌ترین و بهترین گزینه برای خرید آنلاین در ایران محسوب می‌شود.
  یکی از ویژگی‌های مهم در خرید از لاوین، تنوع بی‌نظیر محصولات است. این فروشگاه اینترنتی طیف وسیعی از کالاها را در دسته‌های مختلف از جمله لوازم دیجیتال، لوازم خانگی، مد و پوشاک، لوازم آرایشی و بهداشتی، محصولات سلامت و زیبایی، و بسیاری از محصولات دیگر ارائه می‌دهد.
   ارسال سریع و مطمئن کالا
   یکی از مهم‌ترین دغدغه‌های کاربران خرید آنلاین، زمان تحویل کالا است. لاوین برای حل این مشکل، گزینه‌های مختلف ارسال را در نظر گرفته است تا کاربران بتوانند بر اساس نیاز خود، روش ارسال مناسب را انتخاب کنند. به عنوان مثال، ارسال کالا به صورت ارسال امروز، ارسال سریع توسط پیک‌های لاوین، از جمله روش‌های خرید سریع از این فروشگاه اینترنتی است. این امکانات باعث می‌شود که خریداران بتوانند سفارش خود را در کوتاه‌ترین زمان ممکن دریافت کنند. علاوه بر این، در صورتی که کالای خریداری شده از لحاظ کیفیت یا هر دلیل دیگری رضایت مشتری را جلب نکرده باشد، لاوین ضمانت بازگشت کالا را ارائه می‌دهد. این ویژگی موجب اعتماد بیشتر مشتریان به خرید آنلاین از فروشگاه اینترنتی لاوین شده است.
  `
    $.querySelector('.footer-four__right-text').style.height = 'max-content';
    $.querySelector('.footer-four__right-text').classList.remove('footer-four__right-overlay')

    showMoreFooterBtn.innerHTML =
      `
    <span class="footer-four__right-btn__title">بستن</span>
    <i class="fa fa-arrow-up footer-four__right-btn__icon"> </i>
  `
  }
  else {
    $.querySelector('.footer-four__right-text').innerHTML ==
      `
         لاوین سال‌ها است که به انتخاب اول بسیاری از خریداران اینترنتی تبدیل شده است. لاوین به عنوان بزرگ‌ترین و معتبرترین فروشگاه آنلاین ایران، شناخته‌شده‌ترین فروشگاه نیز محسوب می‌شود. این فروشگاه آنلاین نه‌تنها گسترده‌ترین تنوع کالا را در دسته‌بندی‌های مختلف ارائه می‌دهد، بلکه با خدمات بی‌نظیر، سرعت ارسال بالا، ضمانت اصل بودن کالا و پشتیبانی حرفه‌ای، استاندارد جدیدی در خرید اینترنتی ایران تعریف کرده است. این فروشگاه با سال‌ها تجربه و اعتماد مشتریان، کامل‌ترین و بهترین گزینه برای خرید آنلاین در ایران محسوب می‌شود.
        `
    $.querySelector('.footer-four__right-text').style.height = '110px';
    $.querySelector('.footer-four__right-text').classList.add('footer-four__right-overlay')
    showMoreFooterBtn.innerHTML =
      `
          <span class="footer-four__right-btn__title">مشاهده بیشتر</span>
          <i class="fa fa-arrow-down footer-four__right-btn__icon"> </i>
        `
  }
}

